; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-34)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
(at ball30 room4)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 12 of 34
2. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 12 of 34
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 34
4. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at ball2 roomb) (free right)
   goals met: 13 of 34
5. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at ball3 roomb) (free left)
   goals met: 14 of 34
6. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 14 of 34
7. (pick ball34 room5 left)
   deleted: (at ball34 room5) (free left)
   added: (carry ball34 left)
   goals met: 14 of 34
8. (pick ball33 room5 right)
   deleted: (at ball33 room5) (free right)
   added: (carry ball33 right)
   goals met: 14 of 34
9. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 14 of 34
10. (drop ball33 roomb right)
   deleted: (carry ball33 right)
   added: (at ball33 roomb) (free right)
   goals met: 15 of 34
11. (drop ball34 roomb left)
   deleted: (carry ball34 left)
   added: (at ball34 roomb) (free left)
   goals met: 16 of 34
12. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 16 of 34
13. (pick ball32 room5 left)
   deleted: (at ball32 room5) (free left)
   added: (carry ball32 left)
   goals met: 16 of 34
14. (pick ball31 room5 right)
   deleted: (at ball31 room5) (free right)
   added: (carry ball31 right)
   goals met: 16 of 34
15. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 16 of 34
16. (drop ball31 roomb right)
   deleted: (carry ball31 right)
   added: (at ball31 roomb) (free right)
   goals met: 17 of 34
17. (drop ball32 roomb left)
   deleted: (carry ball32 left)
   added: (at ball32 roomb) (free left)
   goals met: 18 of 34
18. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 18 of 34
19. (pick ball30 room4 left)
   deleted: (at ball30 room4) (free left)
   added: (carry ball30 left)
   goals met: 18 of 34
20. (pick ball29 room4 right)
   deleted: (at ball29 room4) (free right)
   added: (carry ball29 right)
   goals met: 18 of 34
21. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 18 of 34
22. (drop ball29 roomb right)
   deleted: (carry ball29 right)
   added: (at ball29 roomb) (free right)
   goals met: 19 of 34
23. (drop ball30 roomb left)
   deleted: (carry ball30 left)
   added: (at ball30 roomb) (free left)
   goals met: 20 of 34
24. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 20 of 34
25. (pick ball28 room4 left)
   deleted: (at ball28 room4) (free left)
   added: (carry ball28 left)
   goals met: 20 of 34
26. (pick ball27 room4 right)
   deleted: (at ball27 room4) (free right)
   added: (carry ball27 right)
   goals met: 20 of 34
27. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 20 of 34
28. (drop ball27 roomb right)
   deleted: (carry ball27 right)
   added: (at ball27 roomb) (free right)
   goals met: 21 of 34
29. (drop ball28 roomb left)
   deleted: (carry ball28 left)
   added: (at ball28 roomb) (free left)
   goals met: 22 of 34
30. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 22 of 34
31. (pick ball26 room4 left)
   deleted: (at ball26 room4) (free left)
   added: (carry ball26 left)
   goals met: 22 of 34
32. (pick ball25 room4 right)
   deleted: (at ball25 room4) (free right)
   added: (carry ball25 right)
   goals met: 22 of 34
33. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 22 of 34
34. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 23 of 34
35. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 24 of 34
36. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 24 of 34
37. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 24 of 34
38. (pick ball23 room4 right)
   deleted: (at ball23 room4) (free right)
   added: (carry ball23 right)
   goals met: 24 of 34
39. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 24 of 34
40. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 25 of 34
41. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 26 of 34
42. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 26 of 34
43. (pick ball22 room3 left)
   deleted: (at ball22 room3) (free left)
   added: (carry ball22 left)
   goals met: 26 of 34
44. (pick ball21 room3 right)
   deleted: (at ball21 room3) (free right)
   added: (carry ball21 right)
   goals met: 26 of 34
45. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 26 of 34
46. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 27 of 34
47. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 28 of 34
48. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 28 of 34
49. (pick ball20 room3 left)
   deleted: (at ball20 room3) (free left)
   added: (carry ball20 left)
   goals met: 28 of 34
50. (pick ball19 room3 right)
   deleted: (at ball19 room3) (free right)
   added: (carry ball19 right)
   goals met: 28 of 34
51. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 28 of 34
52. (drop ball19 roomb right)
   deleted: (carry ball19 right)
   added: (at ball19 roomb) (free right)
   goals met: 29 of 34
53. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 30 of 34
54. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 30 of 34
55. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 30 of 34
56. (pick ball17 room3 right)
   deleted: (at ball17 room3) (free right)
   added: (carry ball17 right)
   goals met: 30 of 34
57. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 34
58. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 31 of 34
59. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 32 of 34
60. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 32 of 34
61. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 32 of 34
62. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 32 of 34
63. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 33 of 34
64. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 33 of 34
65. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 33 of 34
66. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 33 of 34
67. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 34 of 34
